// 目的：对比逻辑运算符 && & || | 的区别
// 说明：本程序中为了方便几种情况对比，所以统一了变量名。但为了防止变量之间的作用域冲突，手动添加了{}以隔绝作用域，和for的隐藏{}作用相同

public class LogicalOperator {
    public static void main(String[] args) {
        
        // 短路逻辑运算符
        {
            // x先返回值5，再有副作用变成6 ---> 左侧为true，不再运算右侧，进入循环体
            int x = 5;
            int y = 5;
            if (x++ == 5 || ++y == 5) { 
                x = 11;
            }

            System.out.println("x++ == 5 || ++y == 5时：" + "x=" + x + ", y=" + y); // 11，5
        }

        {
            int x = 5;
            int y = 5;
            // x先返回值5，再有副作用变成6，5!=6 ---> 左侧为假，不再运算右侧，不进入循环体
            if (x++ == 6 && ++y == 6) { 
                x = 11;
            }
            System.out.println("x++ == 6 && ++y == 6时：" + "x=" + x + ", y=" + y);  // 6，5
        }

        // 非短路逻辑运算符
        // x先返回值5，再有副作用变成6，5==5，条件判断已为真，但继续执行运算符右侧；y先有副作用变成6，再返回6，6!=5
        {
            int x = 5;
            int y = 5;
            if (x++ == 5 | ++y == 5) { 
                x = 11;
            }

            System.out.println("x++ == 5 | ++y == 5时：" + "x=" + x + ", y=" + y); // 11，6
        }   

        {
            int x = 5;
            int y = 5;
            // x先返回值5，再有副作用变成6，5!=6，条件判断已为假，但继续执行运算符右侧；y先有副作用变成6，再返回6，6==6
            if (x++ == 6 & ++y == 6) { 
                x = 11;
            }

            System.out.println("x++ == 6 & ++y == 6时：" + "x=" + x + ", y=" + y); // 6，6
        }
    }
}

/* 运行结果：
--------------------------------
x++ == 5 || ++y == 5时：x=11, y=5
x++ == 6 && ++y == 6时：x=6, y=5
x++ == 5 | ++y == 5时：x=11, y=6
x++ == 6 & ++y == 6时：x=6, y=6
--------------------------------
*/
