// 目的：根据嵌套循环的程序设计步骤编写金字塔

import java.util.Scanner;

public class Pyramid02 {
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);

        System.out.println("请输入你要打印的金字塔层数(最小为1): ");
        // int totalLevel = sc.nextInt();
        int totalLevel = 5; // 避免每次都要输入，该行代码是用来试验程序逻辑正误的
        
        // 第一步，定维度。外部循环决定建立几层金字塔，内部循环具体输出 空格 和 星星
        for (int i = 1; i <= totalLevel; i++) {

            // 第二步，冻结态
            // i   空格    星星
            // 1    5       1 // 第二步，冻结态，再看每一行中具体怎么执行。假设i固定为1，看内存循环中怎么执行
            // 2    4       3 // 第二步，冻结态，再看每一行中具体怎么执行。假设i固定为2，看内存循环中怎么执行
            // 3    3       5 // 第二步，冻结态，再看每一行中具体怎么执行。假设i固定为3，看内存循环中怎么执行
            // 4    2       7 // 第二步，冻结态，再看每一行中具体怎么执行。假设i固定为4，看内存循环中怎么执行
            // 5    1       9 // 第二步，冻结态，再看每一行中具体怎么执行。假设i固定为5，看内存循环中怎么执行
            // 6    0       11 // 第二步，冻结态，再看每一行中具体怎么执行。假设i固定为6，看内存循环中怎么执行

            // 第三步，找规律
            // 对比i=1,2,3,4,5,6时，找内层循环边界和i的关系。如果是通用规律，转化为数学关系；如果不是，结构化拆解（差异化拆解）
            // 确定规律: 空格+i= 6; 星星 = 2*i-1
            // 确定边界：空格 —— 1～totalLevel-1; 星星：1～2*i-1
            // 验证边界：全部通用

            // 第四步：理状态
            // 变量j遵循最小作用域，变量totalLevel遵循即时初始化
            for (int j = 1; j <= totalLevel - i; j++) {
                System.out.print(" ");
            }
            for (int j = 1; j <= 2*i - 1; j++) {
                System.out.print("*");
            }
            System.out.println("");
        }

        sc.close();
    }
}
/* 运行结果：
--------------------------------
(输入5)
    *    
   ***   
  *****  
 ******* 
*********
--------------------------------
*/