// TODO(2025-11-17 20:20:34) 
// 功能：定义一个常量保存华氏温度，华氏温度转换摄氏温度的公式为：5/9*(华氏温度-100)，请求出华氏温度对应的摄氏温度（取234.5）
// 目的：熟悉算数运算符的用法

public class Homework02 {
    public static void main(String[] args) {
        // 问题：5 / 9 在java运算中，会自动截断小数位，造成精度缺失
        // System.out.println(5 / 9 * (234.5 - 100)); 

        // 解决：需要提高操作数的精度，让结果和它的类型保持一致
        // 方法一：强制类型转换
        System.out.println((double)5 / 9 * (234.5 - 100));

        // 方法二：直接把操作数写成浮点型字面量
        System.out.println(5.0 / 9 * (234.5 - 100));
    }
}

/* 运行结果：
--------------------------------
74.72222222222223
74.72222222222223
--------------------------------
*/